blog/2020/doctoc-generate-toc.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 09:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>使用 DocToc 自动生成文档目录</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">使用 DocToc 自动生成文档目录</h1>
</header><p>
DocToc 为本地 git 存储库中的 markdown
文件生成目录。生成的目录可以正常显示在包括 GitHub 在内的代码托管网站上。
</p>

<p>
用 DocToc 生成的目录：
</p>

<ul class="org-ul">
<li>安装</li>
<li>使用

<ul class="org-ul">
<li>给当前目录及子目录的所有文件添加目录</li>
<li>轻松地更新已存在的由 DocToc 生成的目录</li>
<li>给单个文件添加目录

<ul class="org-ul">
<li>例子</li>
</ul></li>

<li>使用 DocToc 生成兼容其他网站的链接

<ul class="org-ul">
<li>例子</li>
</ul></li>

<li>指定目录的位置</li>
<li>指定自定义目录标题</li>
<li>指定目录的最大标题级别</li>
<li>打印到标准输出</li>
<li>作为一个 Git 钩子使用</li>
</ul></li>
</ul>

<div id="outline-container-安装" class="outline-2">
<h2 id="安装">安装</h2>
<div class="outline-text-2" id="text-安装">
<div class="org-src-container">
<pre class="src src-sh">npm install -g doctoc
</pre>
</div>
</div>
</div>

<div id="outline-container-使用" class="outline-2">
<h2 id="使用">使用</h2>
<div class="outline-text-2" id="text-使用">
<p>
在最简单的用法中，可以将一个或多个文件或文件夹传递给 <code>doctoc</code>
命令。这将更新指定的每个文件以及通过递归搜索每个文件夹找到的每个标记文件的
toc。下面是一些例子。
</p>
</div>

<div id="outline-container-给当前目录及子目录的所有文件添加目录" class="outline-3">
<h3 id="给当前目录及子目录的所有文件添加目录">给当前目录及子目录的所有文件添加目录</h3>
<div class="outline-text-3" id="text-给当前目录及子目录的所有文件添加目录">
<p>
在你本地的 Git 仓库目录下，打开终端，输入：
</p>

<div class="org-src-container">
<pre class="src src-sh">doctoc .
</pre>
</div>

<p>
该命令会更新所有当前目录和子目录的 markdown
文件，用一个内容表指向一个文件对应的各级 markdown 标题，该内容表由
markdown 语法剖析程式生成。DocToc 默认使用 GitHub 语法，但是可以指定其他模式。
</p>
</div>
</div>

<div id="outline-container-轻松地更新已存在的由-doctoc-生成的目录" class="outline-3">
<h3 id="轻松地更新已存在的由-doctoc-生成的目录">轻松地更新已存在的由 DocToc 生成的目录</h3>
<div class="outline-text-3" id="text-轻松地更新已存在的由-doctoc-生成的目录">
<p>
如果你已经有了一个由 DocToc 生成的目录，那 <code>doctoc .</code>
命令执行时，文档会自动更新，而不是插入一个复制版本。DocToc
把生成的目录放在 <code>&lt;!-- START doctoc --&gt;</code> 和 <code>&lt;!-- END doctoc --&gt;</code>
之间，所以你也可以把它放在文档的任何位置，同样可以更新。
</p>
</div>
</div>

<div id="outline-container-给单个文件添加目录" class="outline-3">
<h3 id="给单个文件添加目录">给单个文件添加目录</h3>
<div class="outline-text-3" id="text-给单个文件添加目录">
<p>
如果你只想转换一个文件，这样做：
</p>

<div class="org-src-container">
<pre class="src src-sh">doctoc /path/to/file [...]
</pre>
</div>
</div>

<div id="outline-container-例子" class="outline-4">
<h4 id="例子">例子</h4>
<div class="outline-text-4" id="text-例子">
<div class="org-src-container">
<pre class="src src-sh">doctoc README.md

doctoc CONTRIBUTING.md LICENSE.md
</pre>
</div>

<p>
你可以通过该特征做更复杂的事情。例如，如果你安装了
<a href="http://beyondgrep.com/">ack</a> ，你可以给具体的文件添加
<code>&lt;!-- DOCTOC SKIP --&gt;</code> 然后使用
</p>

<div class="org-src-container">
<pre class="src src-sh">ack -L <span style="color: #ddbc91;">'DOCTOC SKIP'</span> | xargs doctoc
</pre>
</div>

<p>
来仅仅重新编译哪些没有 "DCOTOC SKIP" 注解的文件。
</p>
</div>
</div>
</div>

<div id="outline-container-使用-doctoc-生成兼容其他网站的链接" class="outline-3">
<h3 id="使用-doctoc-生成兼容其他网站的链接">使用 DocToc 生成兼容其他网站的链接</h3>
<div class="outline-text-3" id="text-使用-doctoc-生成兼容其他网站的链接">
<p>
为了添加的内容表能够兼容其他站点，而添加适当的模式标识：
</p>

<p>
可用的模式：
</p>

<div class="org-src-container">
<pre class="src src-sh">--bitbucket bitbucket.org
--nodejs    nodejs.org
--github    github.com
--gitlab    gitlab.com
--ghost     ghost.org
</pre>
</div>
</div>

<div id="outline-container-例子-1" class="outline-4">
<h4 id="例子-1">例子</h4>
<div class="outline-text-4" id="text-例子-1">
<div class="org-src-container">
<pre class="src src-sh">doctoc README.md --bitbucket
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-指定目录位置" class="outline-3">
<h3 id="指定目录位置">指定目录位置</h3>
<div class="outline-text-3" id="text-指定目录位置">
<p>
DocToc 默认将目录放在文档的顶部，你可以通过以下格式，让 DocToc
将生成的目录放在其他地方：
</p>

<div class="org-src-container">
<pre class="src src-sh">&lt;!-- START doctoc --&gt;
&lt;!-- END doctoc --&gt;
</pre>
</div>

<p>
你可以直接把这段代码放在你的 .md 文件中。例如：
</p>

<pre class="example" id="org433897e">
// my_new_post.md
Here we are, introducing the post. It's going to be great!
But first: a TOC for easy reference.

&lt;!-- START doctoc --&gt;
&lt;!-- END doctoc --&gt;

# Section One

Here we'll discuss...
</pre>

<p>
执行命令将会在该处插入目录。
</p>
</div>
</div>

<div id="outline-container-指定自定义目录标题" class="outline-3">
<h3 id="指定自定义目录标题">指定自定义目录标题</h3>
<div class="outline-text-3" id="text-指定自定义目录标题">
<p>
使用 <code>--title</code> 选项可以指定 markdown
格式的自定义目录标题。例子，=doctoc &#x2013;title '<b><b>Contents</b></b>'=。在这之后，你可以简单地执行
=doctoc &lt;file&gt;=，DocToc 会保留你自定义的标题。
</p>

<p>
或者使用 <code>--notitle</code>
选项，用换行把标题空出来。这样会很方便地将该标题移出目录。
</p>
</div>
</div>

<div id="outline-container-指定目录的最大标题级别" class="outline-3">
<h3 id="指定目录的最大标题级别">指定目录的最大标题级别</h3>
<div class="outline-text-3" id="text-指定目录的最大标题级别">
<p>
使用 <code>--maxlevel</code> 选项将 TOC
条目限制为只包含指定级别的标题;例如，=doctoc——maxlevel 3=。
</p>

<p>
默认情况下，对标记格式的标题没有限制，而来自嵌入式 HTML 的标题被限制在 4
个级别。
</p>
</div>
</div>

<div id="outline-container-打印到标准输出" class="outline-3">
<h3 id="打印到标准输出">打印到标准输出</h3>
<div class="outline-text-3" id="text-打印到标准输出">
<p>
可以使用 <code>-s</code> 或 <code>--stdout</code> 选项打印到 stdout。
</p>
</div>
</div>

<div id="outline-container-作为一个-git-钩子使用" class="outline-3">
<h3 id="作为一个-git-钩子使用">作为一个 Git 钩子使用</h3>
<div class="outline-text-3" id="text-作为一个-git-钩子使用">
<p>
通过使用以下配置，doctoc 可以用作 <a href="http://pre-commit.com/">预提交</a>
钩子：
</p>

<pre class="example" id="orga527179">
repos:
-   repo: https://github.com/thlorenz/doctoc
    sha: ...  # substitute a tagged version 
    hooks:
    -   id: doctoc
</pre>

<p>
这将在提交时对标记文件运行 =doctoc=，以确保 TOC 保持最新。
</p>

<hr>

<p>
*参考链接*：
</p>

<ol class="org-ol">
<li><a href="https://www.npmjs.com/package/doctoc">https://www.npmjs.com/package/doctoc</a></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>